app/controllers/todos_controller.rb

  def index
    todos = current_user.todos
    if todos.any?
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = 5
SELECT 1 AS one FROM "todos" WHERE "todos"."user_id" = 8 LIMIT 1

  def create
    todo = current_user.todos.build(todo_params)
    if todo.save
---
INSERT INTO "todos" ("title", "completed", "user_id", "created_at", "updated_at", "description") VALUES ('Buy groceries', FALSE, 8, '2025-10-15 06:45:31.436601', '2025-10-15 06:45:31.436601', 'Milk, eggs, bread') RETURNING "id"

  def destroy
    if @todo
      @todo.destroy
---
DELETE FROM "todos" WHERE "todos"."id" = 1

  def set_todo
    @todo = current_user.todos.find_by(id: params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."user_id" = 1 AND "todos"."id" = 1 LIMIT 1